import Foundation

enum Loc {}

// MARK: - Comos

extension Loc {
    
    enum Comos {
        static let name = "Комос"
        static let placement = "Зал 112. Килик краснофигурный: комос "
        static let description =
        """
        Аттика. Мастер Эрмитажного комоса. Около 440 г. до н. э. 
        Глина. Диаметр 22,5 см 
        Поступил из собрания Пиццати в 1834 г. 
        Инв. № Б. 178 

        Килик — широкая чаша на ножке, с горизонтальными ручками, предназначенная для питья вина. Наружные стороны сосуда украшены изображением комоса — праздничной процессии в честь Диониса: обнаженные юноши, увенчанные нарядными повязками, с плащами, перекинутыми через плечи, двигаются друг за другом. Они держат в руках трости, остродонные амфоры, килики и авлосы, звуки которых сопровождают шествие. Внутри чаши, в медальоне, обрамленном меандром, представлены обнаженный юноша с шестиструнной лирой и девушка с авлосом — предводители процессии. Они подходят для совершения возлияния к изображенному справа лутерию на высокой подставке.
        """
    }
}

// MARK: - DancingGetera

extension Loc {
    
    enum DancingGetera {
        static let name = "Танцующая гетера"
        static let placement = "Зал 111. Килик краснофигурный - танцующая гетера/обнаженная женщина"
        static let description =
        """
        Создано: Древняя Греция. 
        Около 520 г. до н.э.
        Найдено: Греческая колония на острове Березань. Остров Березань в Черном море
        Название: Килик краснофигурный. Обнаженная женщина
        Место создания: Древняя Греция 
        Время создания: Около 520 г. до н.э.
        Место находки: Остров Березань в Черном море
        Археологический памятник: Греческая колония на острове Березань
        Материал: глина
        Размеры: высота: 7,3 см; диаметр: 19,2 см
        Поступление: Поступил в 1906 г. Передан из Императорской Археологической комиссии
        Инвентарный номер: Б-475 

        Аналогии
        1. Похожее изображение из секретного отдела Британского Музея:
        Красно-фигурный килик. Внутри: обнаженная женщина с фаллосом. Снаружи Гермес (?) и 4 быка, сатиры и менады.
        Pottery: red-figured kylix. Interior: naked woman with phalloi. Exterior: Hermes and the cattle of Apollo; satyrs and maenads.  

        """
    }
}

// MARK: - DancingGirl

extension Loc {
    
    enum DancingGirl {
        static let name = "Танцующая девушка"
        static let placement = "Зал 112. Чаша краснофигурная - танцующая девушка"
        static let description =
        """
        Создано: Древняя Греция, Аттика. Дата создания: около 470-460 гг. до н.э.
        Название: Краснофигурное блюдо на высокой ножке
        Место создания: Древняя Греция, Аттика
        Время создания: около 470-460 гг. до н.э.
        Материал: глина
        Размеры: диаметр: 19 см
        Поступление: Поступила в 1834 г. Происходит из собрания Пиццати
        Инвентарный номер: ГР-2007

        На дне изящного блюда (килика) на высокой ножке, изображена юная танцовщица в коротком хитоне. У ее ног лежит пятиструнная кифара, перевитая пурпурной повязкой, а над кифарой - надпись, означающая "идущая во главе хора". Надпись указывает на то, что изображена первая из хоровода юных девушек, исполняющих ритуальный танец на каком-то религиозном празднике. Поза девушки, которая оглядывается назад, словно за ней кто-то идет, и диадема на ее голове (элемент праздничного культового костюма) подтверждают это предположение.
        """
    }
}

// MARK: - Satyr

extension Loc {
    
    enum Satyr {
        static let name = "Сатир"
        static let placement = "Зал 112. Фрагмент донышка чаши- пляшущий сатир"
        static let description =
        """
        Материал: Глина
        Диаметр донышка: 15,1 см
        Поступил в 1862 г. из собрания Кампана

        Пляшущий сатир. Запрокинув в опьянении голову, сатир поет и танцует. В левой руке его мех с вином, правая закинута за голову. За спиной развевается шкура пантеры, завязанная у горла. Волосы на затылке подобраны и перевязаны пурпуровой тенией, дважды пересекающей лысый лоб; концы и петли падают на плечи и грудь. Следы надписи справа и слева.
        """
    }
}
